Revit 2024 API
ParameterTypeId.FabricationProductEntry Property
 "Product Entry"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationProductEntry { get; }
Visual Basic
Public Shared ReadOnly Property FabricationProductEntry As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationProductEntry {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace